## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: gcp/prod
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # argocd_application.cinema is tainted, so must be replaced
-/+ resource "argocd_application" "cinema" {
!       id      = "cinema" -> (known after apply)
        # (2 unchanged attributes hidden)

!       metadata {
-           annotations      = {} -> null
!           generation       = 30 -> (known after apply)
            name             = "cinema"
!           resource_version = "1927465" -> (known after apply)
!           uid              = "17efa20d-cb3a-4860-ac5c-cce632620da2" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

!       spec {
            # (2 unchanged attributes hidden)

            destination {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }

!           source {
                # (3 unchanged attributes hidden)

!               helm {
-                   skip_crds    = false -> null
-                   value_files  = [] -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }
    }

  # argocd_application.cinema-robusta is tainted, so must be replaced
-/+ resource "argocd_application" "cinema-robusta" {
!       id      = "robusta" -> (known after apply)
        # (2 unchanged attributes hidden)

!       metadata {
-           annotations      = {} -> null
!           generation       = 7 -> (known after apply)
            name             = "robusta"
!           resource_version = "1927468" -> (known after apply)
!           uid              = "3f6191a5-2a3d-4b13-87f0-b2b954ad2f3c" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

!       spec {
            # (2 unchanged attributes hidden)

            destination {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }

!           source {
                # (4 unchanged attributes hidden)

!               helm {
-                   value_files  = [] -> null
                    # (3 unchanged attributes hidden)

!                   parameter {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                }
            }

!           sync_policy {
-               automated    = {} -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # argocd_application.keda-scaledobject-cinema-bookings is tainted, so must be replaced
-/+ resource "argocd_application" "keda-scaledobject-cinema-bookings" {
!       id      = "keda-cinema-bookings" -> (known after apply)
        # (2 unchanged attributes hidden)

!       metadata {
-           annotations      = {} -> null
!           generation       = 7 -> (known after apply)
            name             = "keda-cinema-bookings"
!           resource_version = "1927464" -> (known after apply)
!           uid              = "63672f11-0f5b-49fc-87ae-c36e9ba6c322" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

!       spec {
            # (2 unchanged attributes hidden)

            destination {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }

!           source {
                # (3 unchanged attributes hidden)

!               helm {
-                   skip_crds    = false -> null
-                   value_files  = [] -> null
                    # (1 unchanged attribute hidden)

-                   parameter {
-                       force_string = false -> null
-                       name         = "keda.name" -> null
-                       value        = "cinema-bookings" -> null
                    }
-                   parameter {
-                       force_string = false -> null
-                       name         = "keda.namespace" -> null
-                       value        = "cinema" -> null
                    }
-                   parameter {
-                       force_string = false -> null
-                       name         = "keda.scaletargetname" -> null
-                       value        = "cinema-bookings" -> null
                    }
+                   parameter {
+                       name  = "keda.name"
+                       value = "cinema-bookings"
                    }
+                   parameter {
+                       name  = "keda.namespace"
+                       value = "cinema"
                    }
+                   parameter {
+                       name  = "keda.scaletargetname"
+                       value = "cinema-bookings"
                    }
                }
            }
        }
    }

  # argocd_application.keda-scaledobject-cinema-movies is tainted, so must be replaced
-/+ resource "argocd_application" "keda-scaledobject-cinema-movies" {
!       id      = "keda-cinema-movies" -> (known after apply)
        # (2 unchanged attributes hidden)

!       metadata {
-           annotations      = {} -> null
!           generation       = 7 -> (known after apply)
            name             = "keda-cinema-movies"
!           resource_version = "1927461" -> (known after apply)
!           uid              = "3e2c4dee-8017-401b-97e2-aeba7ff658ee" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

!       spec {
            # (2 unchanged attributes hidden)

            destination {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }

!           source {
                # (3 unchanged attributes hidden)

!               helm {
-                   skip_crds    = false -> null
-                   value_files  = [] -> null
                    # (1 unchanged attribute hidden)

-                   parameter {
-                       force_string = false -> null
-                       name         = "keda.name" -> null
-                       value        = "cinema-movies" -> null
                    }
-                   parameter {
-                       force_string = false -> null
-                       name         = "keda.namespace" -> null
-                       value        = "cinema" -> null
                    }
-                   parameter {
-                       force_string = false -> null
-                       name         = "keda.scaletargetname" -> null
-                       value        = "cinema-movies" -> null
                    }
+                   parameter {
+                       name  = "keda.name"
+                       value = "cinema-movies"
                    }
+                   parameter {
+                       name  = "keda.namespace"
+                       value = "cinema"
                    }
+                   parameter {
+                       name  = "keda.scaletargetname"
+                       value = "cinema-movies"
                    }
                }
            }
        }
    }

  # argocd_application.keda-scaledobject-cinema-showtimes is tainted, so must be replaced
-/+ resource "argocd_application" "keda-scaledobject-cinema-showtimes" {
!       id      = "keda-cinema-showtimes" -> (known after apply)
        # (2 unchanged attributes hidden)

!       metadata {
-           annotations      = {} -> null
!           generation       = 7 -> (known after apply)
            name             = "keda-cinema-showtimes"
!           resource_version = "1927462" -> (known after apply)
!           uid              = "4463b2f3-54a3-4da3-a747-75308b49b35c" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

!       spec {
            # (2 unchanged attributes hidden)

            destination {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }

!           source {
                # (3 unchanged attributes hidden)

!               helm {
-                   skip_crds    = false -> null
-                   value_files  = [] -> null
                    # (1 unchanged attribute hidden)

-                   parameter {
-                       force_string = false -> null
-                       name         = "keda.name" -> null
-                       value        = "cinema-showtimes" -> null
                    }
-                   parameter {
-                       force_string = false -> null
-                       name         = "keda.namespace" -> null
-                       value        = "cinema" -> null
                    }
-                   parameter {
-                       force_string = false -> null
-                       name         = "keda.scaletargetname" -> null
-                       value        = "cinema-showtimes" -> null
                    }
+                   parameter {
+                       name  = "keda.name"
+                       value = "cinema-showtimes"
                    }
+                   parameter {
+                       name  = "keda.namespace"
+                       value = "cinema"
                    }
+                   parameter {
+                       name  = "keda.scaletargetname"
+                       value = "cinema-showtimes"
                    }
                }
            }
        }
    }

  # argocd_application.keda-scaledobject-cinema-users is tainted, so must be replaced
-/+ resource "argocd_application" "keda-scaledobject-cinema-users" {
!       id      = "keda-cinema-users" -> (known after apply)
        # (2 unchanged attributes hidden)

!       metadata {
-           annotations      = {} -> null
!           generation       = 7 -> (known after apply)
            name             = "keda-cinema-users"
!           resource_version = "1927463" -> (known after apply)
!           uid              = "35cea502-cf0b-4d4e-bdac-860ca80d5114" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

!       spec {
            # (2 unchanged attributes hidden)

            destination {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }

!           source {
                # (3 unchanged attributes hidden)

!               helm {
-                   skip_crds    = false -> null
-                   value_files  = [] -> null
                    # (1 unchanged attribute hidden)

-                   parameter {
-                       force_string = false -> null
-                       name         = "keda.name" -> null
-                       value        = "cinema-users" -> null
                    }
-                   parameter {
-                       force_string = false -> null
-                       name         = "keda.namespace" -> null
-                       value        = "cinema" -> null
                    }
-                   parameter {
-                       force_string = false -> null
-                       name         = "keda.scaletargetname" -> null
-                       value        = "cinema-users" -> null
                    }
+                   parameter {
+                       name  = "keda.name"
+                       value = "cinema-users"
                    }
+                   parameter {
+                       name  = "keda.namespace"
+                       value = "cinema"
                    }
+                   parameter {
+                       name  = "keda.scaletargetname"
+                       value = "cinema-users"
                    }
                }
            }
        }
    }

  # kubernetes_namespace.cinema will be updated in-place
!   resource "kubernetes_namespace" "cinema" {
        id = "cinema"

!       metadata {
!           annotations      = {
-               "mesh.cloud.google.com/proxy" = jsonencode(
                    {
-                       managed = "true"
                    }
                ) -> null
            }
            name             = "cinema"
            # (4 unchanged attributes hidden)
        }
    }

  # kubernetes_secret.docker_login_secret will be created
+   resource "kubernetes_secret" "docker_login_secret" {
+       data                           = (sensitive value)
+       id                             = (known after apply)
+       type                           = "kubernetes.io/dockerconfigjson"
+       wait_for_service_account_token = true

+       metadata {
+           generation       = (known after apply)
+           name             = "docker-login"
+           namespace        = "cinema"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

Plan: 7 to add, 1 to change, 6 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:gcp/prod workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 248.11 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| gcp/prod | default | 0.00 | 248.11 | 248.11|
| | **Total** | **0.00** | **248.11** | **248.11** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
